In [1]:
import pandas as pd

data = {
    '이름': ['홍길동', '김철수', '이영희', '박민수', '최지우'],
    '수학': [85, 92, 78, 88, 95],
    '영어': [90, 80, 85, 95, 100],
    '과학': [88, 76, 90, 85, 92]
}

df = pd.DataFrame(data)
print(df)
df

    이름  수학   영어  과학
0  홍길동  85   90  88
1  김철수  92   80  76
2  이영희  78   85  90
3  박민수  88   95  85
4  최지우  95  100  92

    이름  수학   영어  과학
0  홍길동  85   90  88
1  김철수  92   80  76
2  이영희  78   85  90
3  박민수  88   95  85
4  최지우  95  100  92

In [10]:
df['평균'] = df[['수학','영어','과학']].mean(axis=1).round(2)

In [12]:
df

    이름  수학   영어  과학     평균
0  홍길동  85   90  88  87.67
1  김철수  92   80  76  82.67
2  이영희  78   85  90  84.33
3  박민수  88   95  85  89.33
4  최지우  95  100  92  95.67